Iniyan-philomath/SmartFarmingProject/arduino/gateway_esp32_receiver.ino
#include <esp_now.h>
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <HTTPClient.h>
#include <esp_wifi.h>
#include <esp_arduino_version.h>

// ==============================================================================
// 1. WI-FI CREDENTIALS FOR DIRECT GOOGLE SHEETS UPLOAD (NO LAPTOP NEEDED)
// ==============================================================================
#define ENABLE_DIRECT_WIFI_SHEET_LOGGING true

// ---> ENTER YOUR WI-FI CREDENTIALS HERE <---
const char* WIFI_SSID         = "YOUR_WIFI_NAME";        
const char* WIFI_PASS         = "YOUR_WIFI_PASSWORD";    

// Deployed Google Apps Script Web App URL
const char* GOOGLE_SCRIPT_URL = "https://script.google.com/macros/s/AKfycbw7ng0kSCqnPxMz5nAjIZ9T-X_hwzSTJ72KnuyftgqQgYEV-KkAxjjZcKrN9a82ogUONw/exec";

#define STATUS_LED 2

// ==============================================================================
// 2. EXACT 34-BYTE TELEMETRY STRUCT (Matches Senders byte-for-byte)
// ==============================================================================
typedef struct __attribute__((packed)) struct_telemetry {
  char  node_id[16];
  float temperature_c;
  float humidity_pct;
  float soil_moisture_pct;
  float rain_intensity_pct;
  bool  rain_detected;
  bool  light_bright;  // true = BRIGHT, false = DARK
} struct_telemetry;

struct_telemetry rxPayload;
volatile bool newDataAvailable = false;

// ==============================================================================
// 3. DIRECT CLOUD UPLOADER (HTTPS POST with HTTP 302 Strict Redirect Follow)
// ==============================================================================
void postTelemetryToGoogleSheet(const struct_telemetry& data, const char* floodRisk, const char* droughtRisk) {
  if (WiFi.status() != WL_CONNECTED) {
    Serial.println(F("[DIRECT CLOUD] Wi-Fi reconnecting..."));
    WiFi.reconnect();
    return;
  }

  WiFiClientSecure client;
  client.setInsecure(); // Bypass Google SSL certificate validation on ESP32

  HTTPClient http;
  if (!http.begin(client, GOOGLE_SCRIPT_URL)) {
    Serial.println(F("[DIRECT CLOUD] HTTP begin failed"));
    return;
  }

  http.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS);
  http.addHeader("Content-Type", "application/json");
  http.setTimeout(10000);

  const char* lightStr = data.light_bright ? "BRIGHT" : "DARK";

  // Construct JSON payload with light_status ("BRIGHT" / "DARK")
  char jsonBuffer[384];
  snprintf(jsonBuffer, sizeof(jsonBuffer),
    "{\"node_id\":\"%s\",\"temperature\":%.1f,\"humidity\":%.1f,\"soil_moisture\":%.1f,\"rain_intensity\":%.1f,\"light_status\":\"%s\",\"light_bright\":%s,\"flood_risk\":\"%s\",\"drought_risk\":\"%s\"}",
    data.node_id,
    data.temperature_c,
    data.humidity_pct,
    data.soil_moisture_pct,
    data.rain_intensity_pct,
    lightStr,
    data.light_bright ? "true" : "false",
    floodRisk,
    droughtRisk
  );

  int httpResponseCode = http.POST((uint8_t*)jsonBuffer, strlen(jsonBuffer));
  if (httpResponseCode > 0) {
    Serial.printf("[DIRECT CLOUD] Google Sheets Sync OK: HTTP %d (Uploaded for %s | Light: %s)\n", 
                  httpResponseCode, data.node_id, lightStr);
  } else {
    Serial.printf("[DIRECT CLOUD] Sheets Upload Error: %s (Code %d)\n", 
                  http.errorToString(httpResponseCode).c_str(), httpResponseCode);
  }
  http.end();
}

// ==============================================================================
// 4. ESP-NOW RECEPTION CALLBACK (Universal Core v2.x & v3.x Compatible)
// ==============================================================================
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
void OnDataRecv(const esp_now_recv_info_t *recv_info, const uint8_t *incomingData, int len)
#else
void OnDataRecv(const uint8_t *mac, const uint8_t *incomingData, int len)
#endif
{
  if (len == sizeof(struct_telemetry)) {
    memcpy(&rxPayload, incomingData, sizeof(rxPayload));
    newDataAvailable = true;
    digitalWrite(STATUS_LED, HIGH);
  } else {
    Serial.printf("[ESP-NOW] Packet size mismatch: Expected %d, got %d bytes\n", sizeof(struct_telemetry), len);
  }
}

// ==============================================================================
// 5. SETUP & INITIALIZATION
// ==============================================================================
void setup() {
  Serial.begin(115200);
  pinMode(STATUS_LED, OUTPUT);
  digitalWrite(STATUS_LED, LOW);

  // Dual Station + SoftAP mode allows ESP-NOW + Wi-Fi simultaneous operation
  WiFi.mode(WIFI_AP_STA);

  if (ENABLE_DIRECT_WIFI_SHEET_LOGGING && strlen(WIFI_SSID) > 0) {
    Serial.printf("[GATEWAY] Connecting to Wi-Fi SSID: %s...\n", WIFI_SSID);
    WiFi.begin(WIFI_SSID, WIFI_PASS);
  }

  if (esp_now_init() != ESP_OK) {
    Serial.println(F("[ERROR] ESP-NOW Init Failed"));
    return;
  }

  esp_now_register_recv_cb(OnDataRecv);

  Serial.println(F("=================================================="));
  Serial.println(F(" SMART AGRI-IOT GATEWAY RECEIVER ONLINE"));
  Serial.printf (" Receiver Station MAC: %s\n", WiFi.macAddress().c_str());
  Serial.println(F("=================================================="));
}

// ==============================================================================
// 6. MAIN LOOP
// ==============================================================================
void loop() {
  if (newDataAvailable) {
    newDataAvailable = false;
    digitalWrite(STATUS_LED, LOW);

    // Dynamic Agricultural Risk Assessment
    const char* floodRisk = (rxPayload.rain_intensity_pct > 50.0 && rxPayload.soil_moisture_pct > 70.0) ? "HIGH" : "NO";
    const char* droughtRisk = (rxPayload.soil_moisture_pct < 20.0 && rxPayload.temperature_c > 32.0) ? "HIGH" : "NO";
    const char* lightStr = rxPayload.light_bright ? "BRIGHT" : "DARK";

    // 1. Output machine-readable serial string
    Serial.printf("SENSOR_DATA:%s,%.2f,%.2f,%.2f,%.2f,%d,%s,%s,%s\n",
                  rxPayload.node_id,
                  rxPayload.temperature_c,
                  rxPayload.humidity_pct,
                  rxPayload.soil_moisture_pct,
                  rxPayload.rain_intensity_pct,
                  rxPayload.rain_detected ? 1 : 0,
                  lightStr,
                  floodRisk,
                  droughtRisk);

    // 2. Direct Cloud Wi-Fi Upload to Google Sheets (Standalone - no laptop required)
    if (ENABLE_DIRECT_WIFI_SHEET_LOGGING && WiFi.status() == WL_CONNECTED) {
      postTelemetryToGoogleSheet(rxPayload, floodRisk, droughtRisk);
    }
  }

  // Periodic Wi-Fi watchdog to keep connection alive
  static unsigned long lastWifiCheck = 0;
  if (millis() - lastWifiCheck > 15000) {
    lastWifiCheck = millis();
    if (WiFi.status() != WL_CONNECTED && ENABLE_DIRECT_WIFI_SHEET_LOGGING) {
      Serial.println(F("[WIFI WATCHDOG] Reconnecting Wi-Fi..."));
      WiFi.reconnect();
    }
  }

  delay(10);
}
